#!C:\app2\Python\python.exe

# **************************************
# 親ディレクトリに参照パス追加
# **************************************
import sys
sys.path.append('..')

# **************************************
# CGI
# **************************************
import cgitb
cgitb.enable()
# **************************************
# MySQL
# **************************************
import mysql.connector

# **************************************
# アプリケーションメソッド
# **************************************
from model import *

# **************************************
# 共有メソッド
# **************************************
from settings import *
set( "base_name", __file__ )

# **************************************
# CGI 初期処理
# **************************************
cgi_init()

# **************************************
# フォームフィールドセット設定
# **************************************
set_field_names( {
    "条件" : "nm",
    "送信ボタン" : "send"
})

# **************************************
# 接続 / 更新兼用
# **************************************
cnn = mysql.connector.connect(
    host='localhost',
    port=3306,
    db='lightbox',
    user='root',
    passwd='',
    charset="utf8",
    autocommit=True)

build_table( cnn )

# **************************************
# 接続解除
# **************************************
cnn.close()

import view

log("画面表示終了")
